# YOLO11 Ultimate Expert Edition - 协同部署 C3k2_HybridFusion 和 C3k2_ODConv_Advanced
# 警告：这是最高复杂度的专家级配置。成功的关键在于严格遵循推荐的训练策略调整。

# Parameters
nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  # Layer 2: 骨干网浅层，开始使用“技巧型”优化器进行特征精炼
  - [-1, 2, C3k2_ODConv_Advanced, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  # Layer 4: 骨干网中层，部署“力量型”主干
  - [-1, 2, C3k2_HybridFusion, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  # Layer 6: 骨干网深层，继续部署“力量型”主干
  - [-1, 2, C3k2_HybridFusion, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  # Layer 8: 骨干网最深处，继续部署“力量型”主干
  - [-1, 2, C3k2_HybridFusion, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, Conv, [512, 1, 1]] # 11
  - [4, 1, Conv, [512, 1, 1]] # 12
  - [[-1, 6, -2], 1, Zoom_cat, []] # 13 cat backbone P4
  # Layer 14: Neck部所有处理层，全部使用“技巧型”优化器进行精细化处理
  - [-1, 2, C3k2_ODConv_Advanced, [512, False]]

  - [-1, 1, Conv, [256, 1, 1]] # 15
  - [2, 1, Conv, [256, 1, 1]] # 16
  - [[-1, 4, -2], 1, Zoom_cat, []] # 17 cat backbone P3
  # Layer 18:
  - [-1, 2, C3k2_ODConv_Advanced, [256, False]]
  - [-1, 1, SCSAB, []] # 19

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 15], 1, Concat, [1]] # 21 cat head P4
  # Layer 22:
  - [-1, 2, C3k2_ODConv_Advanced, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 10], 1, Concat, [1]] # 24 cat head P5
  # Layer 25:
  - [-1, 2, C3k2_ODConv_Advanced, [1024, True]]
  - [-1, 1, SCSAB, []] # 26

  - [[4, 6, 8], 1, CategoryAwareDynamicASF, [256, 4]] # 27
  - [[19, -1], 1, attention_model, []] # 28

  - [[28, 22, 26], 1, Segment, [nc, 32, 256]] # 29
